'''
โครงสร้างควบคุม
1. แบบลำดับ
2. แบบเลือก
3. แบบทำซ้ำ
'''

age = int(input("ป้อนอายุของคุณ : "))

if age >= 15 and age <= 20:
    print ("เป็นวัยรุ่น") # block การทำงานของ if จะต้องทำการระบุ tab ด้วยทุกครัง เนื่องจากไม่มี {} มากำกับการทำงาน
elif age >= 20 and age <= 30:
    print("เป็นวัยผู้ใหญ่")
elif age >= 30:
    print("เป็นวัยทำงาน")
else:
    print("เป็นวัยเด็ก")

# Ternary Oparetor หรือคำสั่งลัด
print ("วัยรุ่น") if age >= 15 else print ("วัยเด็ก")

# การเขียน if ซ้อน if
if age >= 15 and age <= 20:
    if age == 15 :
        print("ม.3")
    elif age == 14 :
        pass # pass คือคำสั่งให้ผ่านไปก่อน ในกรณีที่ยังไม่ระุบหรือคิดไม่ออกว่าจะให้ทำอะไรในด้านใน if
    else :
        print("ประถมศึกษา")
else:
    print("เป็นวัยเด็ก")


print("จบการทำงาน")